Revit 2027 API
ConstraintToRebarEdgeProperties Properties
The ConstraintToRebarEdgeProperties type exposes the following members.
Properties
Name | Description
DistanceToTargetRebar |  The distance to the target rebar's edge. The default value is 0.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
UsePositiveDirectionForZeroOffset |  If true, when offset is zero, the child bar is placed in the default positive direction to avoid the clash, false otherwise. The default value is true.
Top
See Also
Reference
ConstraintToRebarEdgeProperties Class
Autodesk.Revit.DB.Structure Namespace